---
kind: method
id: M:Autodesk.Revit.DB.RepeaterBounds.Dispose
source: html/7b592b4d-75ef-6992-a9e7-4ffe5667f237.htm
---
# Autodesk.Revit.DB.RepeaterBounds.Dispose Method

Releases all resources used by the RepeaterBounds

## Syntax (C#)
```csharp
public void Dispose()
```